examples/render_all_grammars/dot/tests_functional_test_import_relativeimport_relative_third.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40369160[ label="{Third|+third:list[Second]\l}"]

40241304[ label="{ID|}"]

40246840[ label="{STRING|}"]

40252376[ label="{BOOL|}"]

40257912[ label="{INT|}"]

40263448[ label="{FLOAT|}"]

40268984[ label="{STRICTFLOAT|}"]

40679000[ label="{NUMBER|}"]

37552680[ label="{BASETYPE|}"]

40389656[ label="{*OBJECT|}"]

40251432[ label="{Second|BOOL\|INT}"]



40679000 -> 40268984 [dir=back]
40679000 -> 40257912 [dir=back]
37552680 -> 40679000 [dir=back]
37552680 -> 40263448 [dir=back]
37552680 -> 40252376 [dir=back]
37552680 -> 40241304 [dir=back]
37552680 -> 40246840 [dir=back]
40389656 -> 37552680 [dir=back]

}
